## Importing libaraies and csv's

In [1]:
import pandas as pd 
df_3 = pd.read_csv('city_dataframe.csv', keep_date_col = ['closed_date', 'calander_year'])
df_7 = pd.read_csv('seven_cities.csv', keep_date_col = ['closed_date', 'calander_year'])

## Assigning data frames to a variable

In [2]:
all_10 = (df_3),(df_7)

In [3]:
all_10

(      calendar_year          city state closed_date  amount_awarded
 0            2010.0  Philadelphia    PA  2010-01-11          3871.0
 1            2010.0  Philadelphia    PA  2010-01-12         45000.0
 2            2010.0  Philadelphia    PA  2010-01-21         25000.0
 3            2010.0  Philadelphia    PA  2010-01-26           750.0
 4            2010.0  Philadelphia    PA  2010-01-27         12500.0
 ...             ...           ...   ...         ...             ...
 1529         2015.0   New Orleans    LA  2015-07-13         22500.0
 1530         2015.0   New Orleans    LA  2015-11-17        250000.0
 1531         2017.0   New Orleans    LA  2017-12-29       1090000.0
 1532         2014.0   New Orleans    LA  2014-04-15           200.0
 1533         2017.0   New Orleans    LA  2017-09-05          1000.0

 [1534 rows x 5 columns],
      calendar_year          city state closed_date  amount_awarded
 0           2019.0   Baton Rouge    LA  2019-07-08        45640.50
 1           2019.0   Baton Rouge    LA  2019-08-14        30445.62
 2           2019.0   Baton Rouge    LA  2019-02-27        52504.00
 3           2018.0   Baton Rouge    LA  2018-12-11        20000.00
 4           2018.0   Baton Rouge    LA  2018-07-16       107795.30
 ..             ...           ...   ...         ...             ...
 870         2010.0  Indianapolis    IN  2010-09-24         7500.00
 871         2010.0  Indianapolis    IN  2010-11-17         6500.00
 872         2010.0  Indianapolis    IN  2010-11-17        18000.00
 873         2010.0  Indianapolis    IN  2010-12-07         1000.00
 874         2010.0  Indianapolis    IN  2010-12-16        70000.00

 [875 rows x 5 columns])

## Concatenating data frames

In [4]:
sam_10_cities = pd.concat(all_10)

In [5]:
sam_10_cities

     calendar_year          city state closed_date  amount_awarded
0           2010.0  Philadelphia    PA  2010-01-11          3871.0
1           2010.0  Philadelphia    PA  2010-01-12         45000.0
2           2010.0  Philadelphia    PA  2010-01-21         25000.0
3           2010.0  Philadelphia    PA  2010-01-26           750.0
4           2010.0  Philadelphia    PA  2010-01-27         12500.0
..             ...           ...   ...         ...             ...
870         2010.0  Indianapolis    IN  2010-09-24          7500.0
871         2010.0  Indianapolis    IN  2010-11-17          6500.0
872         2010.0  Indianapolis    IN  2010-11-17         18000.0
873         2010.0  Indianapolis    IN  2010-12-07          1000.0
874         2010.0  Indianapolis    IN  2010-12-16         70000.0

[2409 rows x 5 columns]

## Converting data frame to csv

In [6]:
sam_10_cities.to_csv('sam_10_cities.csv', index = False)